// 1. Об'єм

// Напишіть веб - додаток для розрахунку об'єму циліндра. Користувач вводить висоту циліндра і діаметр основи.
// V = π⋅(d/2)2⋅h
const height = prompt('Введіть висоту циліндра', 10);
const diameter = prompt('Введіть діаметр циліндра', 5);

const pi = 3.14;
const capacity = pi * (diameter / 2) * (diameter / 2) * (height);
console.log(capacity);

// 2. Привітання

// Запитайте в користувача його ім'я і виведіть у відповідь: "Привіт, його ім'я!".
const userName = prompt("Ваше ім'я", 'Софія');
console.log('Привіт,', userName);

// 3. Периметр квадрата

// Запитайте у користувача довжину сторони квадрата і виведіть периметр такого квадрата.
const length = prompt('Введіть довжину сторони квадрата', 10);
console.log(length * 4);
// 4. Швидкість
const distance = prompt('Введіть відстань у [км]', 100);
const time = prompt('Введіть час у [год]', 2);
const speed = distance / time;
console.log(speed + ' км/год');
// Запитайте в користувача відстань у км між двома містами та за скільки годин він хоче дістатися.Порахуйте швидкість, з якою необхідно рухатися, щоб встигнути вчасно.